[
    {
        "id" : 1,
        "name1" : "พาสต้าซอสครีม",
        "name2" : "Pasta cream sauce",
        "ingredient" : [
            "แฮมหั่นชิ้นสี่เหลี่ยม 50 กรัม",
            "เส้นพาสต้า(ตามใจชอบ) ต้มสุก 150 กรัม",
            "กระเทียมสับ 1/2 ช้อนโต๊ะ",
            "หอมหัวใหญ่สับ 2 ช้อนโต๊ะ",
            "น้ำมันมะกอก 1 ช้อนโต๊ะ",
            "แป้งสาลีอเนกประสงค์ 2 1/2 ช้อนชา",
            "วิปครีมชนิดจืด 1/4 ถ้วยตวง",
            "นมสด 1/2 ถ้วยตวง",
            "ใบกระวาน 1 ใบ",
            "เห็ดแชมปิญองสไลซ์ 50 กรัม",
            "พริกไทยดำป่น 1/4 ช้อนชา",
            "เกลือป่นละเอียด 1/8-1/4 ช้อนชา",
            "พาร์สลีย์สับ สำหรับโรย",
            "พาร์มีซานชีส สำหรับโรย"
        ],
        "method" : [
            "ตั้งกระทะใส่น้ำมันมะกอกพอร้อน ใส่หอมหัวใหญ่และกระเทียมลงผัดพอหอม",
            "ใส่แป้งสาลีอเนกประสงค์ลงผัดพอสุก ค่อย ๆ เติมวิปครีมและนมสดลงไปจนหมด รอจนส่วนผสมเดือด",
            "ใส่แฮม เห็ดแชมปิญอง ใบกระวาน พริกไทยดำป่น และเกลือป่น ลงผัดพอเข้ากัน (หากส่วนผสมข้นเกินไปสามารถเติมนมสดเพิ่มได้)",
            "ใส่เส้นพาสต้า ผัดให้เข้ากันอีกครั้ง ตักใส่ภาชนะ โรยพาร์สลีย์และพาร์มีซานชีส จัดเสิร์ฟ"
        ],
        "image_top" : "/src/assets/pasta-topview.png",
        "image_land" : "/src/assets/pasta-landscape.png",
        "Kcal" : 400,
        "level" : "middle",
        "time_pre" : 15,
        "time_cook" : 30
    },
    {
        "id" : 2,
        "name1" : "ไก่ทอดสไตล์เกาหลี",
        "name2" : "Korean fried chicken",
        "ingredient" : [
            "ซอสหอยนางรม 3 ช้อนโต๊ะ",
            "ซอสถั่วเหลือง ½ ช้อนโต๊ะ",
            "น้ำส้มสายชู 1 ช้อนโต๊ะ",
            "ปีกไก่บน 1 กิโลกรัม",
            "แป้งสาลี 2 ถ้วยตวง",
            "น้ำมันพืช (สำหรับทอด) 1 ลิตร",
            "น้ำตาลทราย 3 ช้อนโต๊ะ",
            "น้ำเปล่า 3 ช้อนโต๊ะ",
            "กระเทียมสับ 4 กลีบ",
            "หอมใหญ่สับ 3 ช้อนโต๊ะ",
            "พริกป่นเกาหลี ½ ช้อนโต๊",
            "น้ำพริกเผา ½ ช้อนโต๊ะ",
            "น้ำมันพืช (สำหรับผัด) 2 ช้อนโต๊"
        ],
        "method" : [
            "คลุกเคล้าปีกไก่บนกับแป้งสาลีโดยไม่ต้องผสมน้ำ จากนั้นพักไว้ประมาณ 5 นาที และคลุกเคล้ากับแป้งสาลีอีกครั้ง",
            "นำปีกไก่บนที่คลุกเคล้าแล้วไปทอดในน้ำมัน ใช้ไฟกลางประมาณ 12 นาที แล้วตักขึ้นพักไว้ประมาณ 3 นาที จึงนำไปทอดอีกครั้งด้วยไฟแรง 3 นาที จากนั้นตักขึ้นสะเด็ดน้ำมัน",
            "ผัดน้ำซอสโดย นำกระทะตั้งไฟจนร้อนใส่น้ำมันพืช ผัดกระเทียมและหอมใหญ่จนหอม ปรุงรสด้วยซอสหอยนางรม, ซอสปรุงรสฝาเขียว, น้ำส้มสายชู, พริกป่นเกาหลี น้ำพริกเผา และน้ำเปล่าผัดให้เข้ากัน จากนั้นเคี่ยวไว้ประมาณ 2 นาที จากนั้นนำปีกไก่ที่ทอดเสร็จแล้วมาคลุกเคล้าในกระทะให้เข้ากัน จัดใส่จานพร้อมเสิร์ฟคู่กับไชเท้าดอง หรือข้าวสวยร้อนๆ"
        ],
        "image_top" : "/src/assets/friedChicken-topview.png",
        "image_land" : "/src/assets/friedChicken-landscape.png",
        "Kcal" : 450,
        "level" : "middle",
        "time_pre" : 20,
        "time_cook" : 25
    },
    {
        "id" : 3,
        "name1" : "สลัดคีโต ปลาแซลมอนย่าง",
        "name2" : "Keto salmon salad",
        "ingredient" : [
            "ปลาแซลม่อนหั่นชิ้น 125 กรัม",
            "น้ำมันพืชสำหรับย่าง 1 ช้อนโต๊ะ",
            "ซีอิ๊วขาว 2 ช้อนชา",
            "น้ำมันมะกอก ¼ ถ้วยตวง",
            "ซีอิ๊วขาว 2 ช้อนโต๊ะ",
            "พริกไทยขาวป่น ½ ช้อนชา",
            "น้ำมันงา 1 ช้อนโต๊ะ",
            "น้ำมะนาว ½ ช้อนโต๊ะ",
            "งาขาวคั่ว 2 ช้อนชา",
            "ผักสลัดตามใจชอบ 2 ถ้วยตวง",
            "ซุกินีหั่นเต๋า ¼ ถ้วยตวง",
            "มะกอกดำหั่นสไลซ์ 1 ลูก",
            "พริกยักษ์เขียว เหลือง แดง หั่นเต๋า ¼ ถ้วยตวง",
            "หอมแดงหั่นเต๋า ¼ ถ้วยตวง",
            "มะเขือเทศเชอรี่ 3 ลูก",
            "เม็ดมะม่วงหิมพานต์คั่ว ตามชอบ"
        ],
        "method" : [
            "เริ่มทำปลาแซลมอนย่าง โดยตั้งกระทะไฟกลาง ใส่น้ำมันพืชรอให้ร้อน จี่หนังให้สุกและเกรียมก่อน จึงจี่เนื้ออีกฝั่งให้สุก",
            "เมื่อปลาสุกแล้ว เหยาะซีอิ๊วขาว Gluten Freeลงไปคั่วในกระทะร้อนๆ ยกออกจากเตา",
            "เริ่มทำน้ำสลัด โดยผสมน้ำมันมะกอก ซีอิ๊วขาว Gluten Free และพริกไทยขาวป่ น้ำมันงา และน้ำมะนาวเข้าด้วยกัน",
            "จัดจานสลัดให้สวยงาม ทานคู่กับปลาแซลมอนย่างและน้ำสลัด"
        ],
        "image_top" : "/src/assets/salad-topview.png",
        "image_land" : "/src/assets/salad-landscape.png",
        "Kcal" : 300,
        "level" : "middle",
        "time_pre" : 5,
        "time_cook" : 10
    },
    {
        "id" : 4,
        "name1" : "ต้มยำกุ้ง",
        "name2" : "Tom Yum Kung",
        "ingredient" : [
            "กุ้งกุลาดำตัวใหญ่ หรือกุ้งแม่น้ำ ตามใจชอบ",
            "เห็ดฟางผ่าครึ่ง ตามใจชอบ",
            "พริกขี้หนู ตามใจชอบ",
            "ใบมะกรูดฉีกเอาก้านออก ตามใจชอบ",
            "ข่าหั่นแว่น ตามใจชอบ",
            "ตะไคร้ทุบแล้วหั่นท่อน ตามใจชอบ",
            "ผักชี โรยหน้า ตามใจชอบ",
            "น้ำพริกเผา 1 ช้อนชา",
            "มะนาว 2 ลูก",
            "กะทิหรือนมข้นจืด 1/2 ถ้วย",
            "น้ำตาล 1/2 ช้อนโต๊ะ",
            "น้ำปลา 1 ช้อนโต๊ะ",
            "เกลือ 1 หยิบมือ",
            "น้ำซุป (ถ้าไม่มีเป็นซุปสำเร็จรูปกับน้ำเปล่า)"
        ],
        "method" : [
            "ก่อนอื่นต้องแกะเปลือกกุ้งผ่าเอาเส้นดำออกล้างให้สะอาด หั่นเครื่องต้มยำ พริก ขิง ข่า ตะไคร้ ใบมะกรูดและเห็ดให้พร้อม",
            "นำน้ำซุปไปตั้งไฟให้เดือด ใส่เครื่องต้มยำลงไปให้หมด พอเดือดอีกครั้งก็ใสกุ้งที่เตรียมไว้ลงไปเลยหลังจากใส่กุ้งลงไปแล้ว ให้ใส่ น้ำตาล น้ำปลา พริกขี้หนู พริกเผา ใครชอบรสแบบไหนใส่ลงไปตามชอบ ตามด้วยเห็ดฟาง",
            "ปิดเตาแล้วค่อยปรุงด้วยมะนาว(เคล็ดลับการบีบน้ำมะนาว ไม่ควรใส่มะนาวในน้ำที่กำลังเดือด เพราะจะทำให้มะนาวและน้ำซุปมีรสชม) โรยเกลือนิดหน่อยเพื่อดึงรสเปรี้ยวหวานเค้มให้เข้มข้นมากยิ่งขึ้น",
            "จัดชามเสิร์ฟ หั่นผักโรยหน้า เพิ่มความหอม"
        ],
        "image_top" : "/src/assets/tomyum-topview.png",
        "image_land" : "/src/assets/tomyum-landscape.png",
        "Kcal" : 400,
        "level" : "middle",
        "time_pre" : 60,
        "time_cook" : 10
    },
    {
        "id" : 5,
        "name1" : "บิบิมบับ",
        "name2" : "Bibimbup",
        "ingredient" : [
            "หมูสามชั้นสไลด์ 80 กรัม",
            "แครอทหั่นเส้น 100 กรัม",
            "ถั่วงอก 100 กรัม",
            "ผักโขม 100 กรัม",
            "แตงกวาญี่ปุ่น 100 กรัม",
            "เห็ดหอมแห้ง (แช่น้ำ) หั่นเส้น 3 ดอก",
            "งาขาวคั่ว 10 กรัม",
            "ซีอิ๊วขาว 1 ช้อนโต๊ะ",
            "น้ำตาลทราย 1 ช้อนโต๊ะ",
            "น้ำมันงา 2 ช้อนโต๊ะ",
            "เกลือ 1/2 ช้อนชา",
            "น้ำส้มสายชู 5 ช้อนโต๊ะ",
            "ไข่แดง 1 ฟอง",
            "กิมจิ 120 กรัม",
            "โคชูจัง 2 ช้อนโต๊ะ",
            "ข้าวญี่ปุ่น (หุงสุก) 200 กรัม"
        ],
        "method" : [
            "ใช้มีดหั่นเห็ดหอม แตงกวา แครอท เป็นเส้น ๆ ส่วนถั่วงอก ผักโขม จัดใส่ชาม เตรียมไว้",
            "ตั้งกระทะ ใส่งาขาว แล้วคั่วด้วยไฟอ่อน ให้มีสีเหลืองหอม เสร็จแล้ว ตักใส่ถ้วย เตรียมไว้",
            "ผัดผักทีละชนิด เริ่มจาก แตงกวา แครอท เห็ดหอม ถั่วงอก ผักโขม โดยระหว่างผัด ให้ปรุงรสด้วย เกลือ 1/2 ช้อนชา น้ำส้มสายชู 1 ช้อนโต๊ะ และ น้ำมันงา 1 ช้อนโต๊ะ ต่อ ผัก 1 ชนิด",
            "ใส่เนื้อหมูสามชั้นลงไป ผัดให้สุก แล้วปรุงรสด้วย ซีอิ๊วขาว น้ำตาล ผัดคลุกเคล้าให้เข้ากัน",
            "จัดจาน เอาแปรงจุ่มน้ำมันงา ทาก้น หม้อดินแบบเกาหลี ให้ทั่ว จากนั้น ใส่ข้าวญี่ปุ่นลงไป",
            "ใช้ตะเกียบคีบผัก หมูสามชั้น และ กิมจิ จัดวางเรียงแต่ละอย่างลงไปด้านบนให้สวยงาม",
            "โรยหน้าด้วยงาขาว ซอสโคชูจัง และ ไข่แดง ลงไป เป็นอันเสร็จ"
        ],
        "image_top" : "/src/assets/bibimbup-topview.png",
        "image_land" : "/src/assets/bibimbup-landscape.png",
        "Kcal" : 380,
        "level" : "middle",
        "time_pre" : 25,
        "time_cook" : 10
    },
    {
        "id" : 6,
        "name1" : "ผัดผัก",
        "name2" : "Stir fried vegetables",
        "ingredient" : [
            "บร็อคโคลี่ 200 กรัม",
            "เห็ด 100 กรัม",
            "ซีอิ๊วขาว 1 1/2 ช้อนโต๊ะ",
            "ซอสปรุงรส 1 ช้อนชา",
            "น้ำตาลทรายขาว 1 ช้อนชา",
            "น้ำสะอาด 1/2 ถ้วย",
            "แป้งมัน 1/2 ช้อนชา",
            "กระเทียมสับ 2 ช้อนโต๊ะ",
            "น้ำมันพืช 2 ช้อนโต๊ะ"
        ],
        "method" : [
            "ลวก บร็อคโคลี่และแครอท ในน้ำเดือด พอสุก ตักขึ้นน็อคน้ำเย็น พักให้สะเด็ดน้ำ",
            "ผสมแป้งมันกับน้ำสะอาดให้เข้ากัน พักไว้",
            "ใส่น้ำมันลงกระทะ ยกขึ้นตั้งไฟพอร้อน ใช้ไฟกลาง ใส่กระเทียมลงผัดพอหอม",
            "ใส่เห็ดลงผัด ผัดพอเห็ดสุก ใส่ผักที่ลวก ปรุงรสด้วย ซีอิ๊วขาวออร์แกนิก ซอสปรุงรสออร์แกนิก น้ำตาลทราย ใช้ไฟแรงในการผัด ใส่แป้งละ ลายน้ำ ผัดให้เข้ากัน ยกลงจากเตา ตักใส่จาน จัดเสิร์ฟ พร้อมรับประทาน"
        ],
        "image_top" : "/src/assets/stir-topview.png",
        "image_land" : "/src/assets/stir-landscape.png",
        "Kcal" : 227,
        "level" : "middle",
        "time_pre" : 15,
        "time_cook" : 10
    },
    {
        "id" : 7,
        "name1" : "มิโซะราเม็ง",
        "name2" : "miso ramen",
        "ingredient" : [
            "เส้นราเมง 1 ก้อน",
            "หมูชาชูสไลซ์ 3 ชิ้น",
            "หน่อไม้ญี่ปุ่นปรุงรส 1/4 ถ้วย",
            "ไข่ต้มยางมะตูม 1 ฟอง",
            "เมล็ดข้าวโพดหวานต้มสุก 1/4 ถ้วย",
            "สาหร่ายวากาเมะ 1/4 ถ้วย",
            "ต้นหอมญี่ปุ่นซอย 1/4 ถ้วย",
            "มิโซะ 1/4 ถ้วย",
            "โคชูจัง 2 ช้อนโต๊ะ",
            "ผงดาชิ 1 ซอง (6 กรัม)",
            "น้ำเปล่า 4 ถ้วย"
        ],
        "method" : [
            "ทำน้ำซุปโดยต้มน้ำให้เดือด ใส่ผงดาชิ มิโซะ และโคชูจัง คนทั้งหมดให้ละลาย ชิมและปรุงรสเพิ่มด้วยโชยุตามชอบ",
            "ลวกเส้นราเมงให้สุก ตักขึ้นใส่ชาม วางหมูชาชูสไลซ์  หน่อไม้ญี่ปุ่น ไข่ต้มยางมะตูม เมล็ดข้าวโพดหวาน และสาหร่ายวากาเมะ โรยต้นหอมญี่ปุ่นซอย ตักน้ำซุปร้อนๆ ใส่ชาม"
        ],
        "image_top" : "/src/assets/ramen-topview.png",
        "image_land" : "/src/assets/ramen-landscape.png",
        "Kcal" : 470,
        "level" : "middle",
        "time_pre" : 25,
        "time_cook" : 40
    },
    {
        "id" : 8,
        "name1" : "ชาบูน้ำดำ",
        "name2" : "Shabu",
        "ingredient" : [
            "น้ำเปล่า 2 ลิตร",
            "ปลาโอแห้ง 30 กรัม",
            "ซีอิ้วญี่ปุ่น ์ 200 มิลลิลิตร",
            "น้ำตาลทรายแดง 4 ช้อนโต๊ะ",
            "เนื้อสัตว์ ตามใจชอบ",
            "ผัก ตามใจชอบ"
        ],
        "method" : [
            "เทน้ำเปล่าลงในหม้อ รอจนน้ำเดือด ใส่เนื้อปลาโอแห้ง ต้มต่อประมาณ 5 นาที หรือจนเริ่มเดือด แล้วตักเนื้อปลาออก ปรุงรสด้วย All Purpose Premium และน้ำตาลทรายแดงคนให้เข้ากัน",
            "เทน้ำจิ้มสุกี้ นำชุดผักรวมใส่ลงไป ตามด้วยชุดหมูสไลด์ หรือสามารถใส่ของที่ชอบอย่างอื่นนอกเหนือจากนี้ลงไปในหม้อชาบูก็ได้",
            "จัดเสิร์ฟ นำหม้อชาบูตั้งไฟจนเดือด คีบผัก หรือหมูที่ชอบมาจิ้มกับน้ำจิ้มสุกี้ เพียงแค่นี้ “ชาบู” ของเราก็พร้อมปาร์ตี้กับผองเพื่อนแล้ว"
        ],
        "image_top" : "/src/assets/shabu-topview.png",
        "image_land" : "/src/assets/shabu-landscape.png",
        "Kcal" : 280,
        "level" : "easy",
        "time_pre" : 10,
        "time_cook" : 15
    },
    {
        "id" : 9,
        "name1" : "บะหมี่อบน่องเป็ดเต้าเจี้ยว",
        "name2" : "Braised duck soybean paste with egg noodle",
        "ingredient" : [
            "น่องเป็ด 500 กรัม",
            "เต้าเจี้ยว 2 ช้อนโต๊ะ",
            "ซอสหอยนางรม 2 ช้อนโต๊ะ",
            "ซีอิ๊วดำ 1 ช้อนโต๊ะ",
            "น้ำตาลมะพร้าว 4 ช้อนโต๊ะ",
            "ผงพะโล้ 1 ช้อนชา",
            "น้ำสะอาด 1.5 ลิตร",
            "บะหมี่ 6 ก้อน",
            "บ๊อกฉ่อย 500 กรัม",
            "น่องเป็ดตุ๋น 1 สูตร",
            "น้ำเป็ดตุ๋น 0.6 ลิตร"
        ],
        "method" : [
            "ใส่น้ำสะอาดลงในหม้อ ยกขึ้นตั้งไฟพอเดือด ใส่น่องเป็ด ผงพะโล้ ปรุงรสด้วยเต้าเจี้ยวสูตร 1 ซอสหอยนางรมสูตรเข้มข้น ซีอิ๊วดำฉลากส้ม",
            "น้ำตาลมะพร้าว ตุ๋นด้วยไฟอ่อน นาน 1 ชั่วโมง ครบเวลา ยกลงจากเตา พักไว้",
            "ใส่น้ำสะอาดลงในกระทะ ยกขึ้นตั้งไฟพอเดือด ใส่บ๊อกฉ่อยลงลวก 1 นาที ตักขึ้นน็อคน้ำเย็น",
            "ใส่บะหมี่ลงลวก 1 นาที บะหมี่สุก ตักขึ้น พักไว",
            "ใส่บะหมี่ลงในหม้อดิน ราดน้ำพะโล้ วางน่องเป็ดตุ๋น วางบ๊อกฉ่อย ยกขึ้นตั้งไฟ ใช้ไฟอ่อนอบ 2 นาที ครบเวลา ยกลงจากเตา จัดเสิร์ฟ"
        ],
        "image_top" : "/src/assets/duck-topview.png",
        "image_land" : "/src/assets/duck-landscape.png",
        "Kcal" : 340,
        "level" : "middle",
        "time_pre" : 25,
        "time_cook" : 35
    }
]